#version: 0.2
C C
CC CC
( =
CCCC CCCC
O C
CC C
O CC
) (
C OC
N C
CCCCCCCC CCCC
C O
CCCCCCCC C
CO P
C l
CCCCCCCC CCCCCCCC
CCCC CC
CCCCCCCCCCCC C
CCCC CCC
) [
] (
S i
C N
- ]
CCCCCCCC CCC
CCCCCCCCCCCC CC
CCCC C
CCCCCCCC CC
CCCCCCCC CCCCCCCCC
+ ]
CCCCCCCCCCCC CCC
CCCCCCCC CCCCCCCCCCCCC
CCCCCCCCCCCCCCCC CC
CC N
) (=
. [
