{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "S(=O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "S(=O)(=O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "S(=S)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "CS",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "CO",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "=O",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "(=O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "C=C",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "CC",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "OH",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "CHO",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "C=O",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "C=O(O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "COOH",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "C=N",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "NHC(O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "NO",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "NCN",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "NN",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "SS",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "(CN)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "Cl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "Br",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 120,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "S(=O)": 0,
      "S(=O)(=O)": 1,
      "S(=S)": 2,
      "CS": 3,
      "CO": 4,
      "=O": 5,
      "(=O)": 6,
      "C=C": 7,
      "CC": 8,
      "OH": 9,
      "CHO": 10,
      "C=O": 11,
      "C=O(O)": 12,
      "COOH": 13,
      "C=N": 14,
      "NHC(O)": 15,
      "NO": 16,
      "NCN": 17,
      "NN": 18,
      "SS": 19,
      "(CN)": 20,
      "Cl": 21,
      "Br": 22,
      "#": 23,
      "%": 24,
      "(": 25,
      ")": 26,
      "+": 27,
      "-": 28,
      ".": 29,
      "0": 30,
      "1": 31,
      "2": 32,
      "3": 33,
      "4": 34,
      "5": 35,
      "6": 36,
      "7": 37,
      "8": 38,
      "9": 39,
      "=": 40,
      "A": 41,
      "B": 42,
      "C": 43,
      "D": 44,
      "E": 45,
      "F": 46,
      "G": 47,
      "H": 48,
      "I": 49,
      "K": 50,
      "L": 51,
      "M": 52,
      "N": 53,
      "O": 54,
      "P": 55,
      "R": 56,
      "S": 57,
      "T": 58,
      "U": 59,
      "V": 60,
      "W": 61,
      "X": 62,
      "Y": 63,
      "Z": 64,
      "[": 65,
      "]": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "y": 86,
      "CCCC": 87,
      "(=": 88,
      "CCCCCCCC": 89,
      "OC": 90,
      "CCC": 91,
      "OCC": 92,
      ")(": 93,
      "COC": 94,
      "NC": 95,
      "CCCCCCCCCCCC": 96,
      "CCCCCCCCC": 97,
      "COP": 98,
      "CCCCCCCCCCCCCCCC": 99,
      "CCCCCC": 100,
      "CCCCCCCCCCCCC": 101,
      "CCCCCCC": 102,
      ")[": 103,
      "](": 104,
      "Si": 105,
      "CN": 106,
      "-]": 107,
      "CCCCCCCCCCC": 108,
      "CCCCCCCCCCCCCC": 109,
      "CCCCC": 110,
      "CCCCCCCCCC": 111,
      "CCCCCCCCCCCCCCCCC": 112,
      "+]": 113,
      "CCCCCCCCCCCCCCC": 114,
      "CCCCCCCCCCCCCCCCCCCCC": 115,
      "CCCCCCCCCCCCCCCCCC": 116,
      "CCN": 117,
      ")(=": 118,
      ".[": 119
    },
    "merges": [
      "C C",
      "CC CC",
      "( =",
      "CCCC CCCC",
      "O C",
      "CC C",
      "O CC",
      ") (",
      "C OC",
      "N C",
      "CCCCCCCC CCCC",
      "C O",
      "CCCCCCCC C",
      "CO P",
      "C l",
      "CCCCCCCC CCCCCCCC",
      "CCCC CC",
      "CCCCCCCCCCCC C",
      "CCCC CCC",
      ") [",
      "] (",
      "S i",
      "C N",
      "- ]",
      "CCCCCCCC CCC",
      "CCCCCCCCCCCC CC",
      "CCCC C",
      "CCCCCCCC CC",
      "CCCCCCCC CCCCCCCCC",
      "+ ]",
      "CCCCCCCCCCCC CCC",
      "CCCCCCCC CCCCCCCCCCCCC",
      "CCCCCCCCCCCCCCCC CC",
      "CC N",
      ") (=",
      ". ["
    ]
  }
}