#version: 0.2
C C
CC CC
( =
CCCC CCCC
O C
] (
CC C
) (
C OC
@ @
CCCCCCCC CCCCCCCC
C O
N C
CCCC C
CO P
C l
CCCC CCC
CCCC CC
) [
CCCCCCCC C
O CC
]( [
S i
C N
- ]
CCCCCCCC CCC
CCCCCCCC CCCCC
) /
+ ]
CCCCCCCCCCCCCCCC C
CCCCCCCC CCCC
CCCCCCCC CC
CCCCCCCCCCCCCCCC CCCCC
