{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 100,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "#": 0,
      "%": 1,
      "(": 2,
      ")": 3,
      "+": 4,
      "-": 5,
      ".": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "@": 19,
      "A": 20,
      "B": 21,
      "C": 22,
      "D": 23,
      "E": 24,
      "F": 25,
      "G": 26,
      "H": 27,
      "I": 28,
      "K": 29,
      "L": 30,
      "M": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "[": 44,
      "\\": 45,
      "]": 46,
      "a": 47,
      "b": 48,
      "c": 49,
      "d": 50,
      "e": 51,
      "f": 52,
      "g": 53,
      "h": 54,
      "i": 55,
      "k": 56,
      "l": 57,
      "m": 58,
      "n": 59,
      "o": 60,
      "p": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "y": 66,
      "CC": 67,
      "CCCC": 68,
      "(=": 69,
      "CCCCCCCC": 70,
      "OC": 71,
      "](": 72,
      "CCC": 73,
      ")(": 74,
      "COC": 75,
      "@@": 76,
      "CCCCCCCCCCCCCCCC": 77,
      "CO": 78,
      "NC": 79,
      "CCCCC": 80,
      "COP": 81,
      "Cl": 82,
      "CCCCCCC": 83,
      "CCCCCC": 84,
      ")[": 85,
      "CCCCCCCCC": 86,
      "OCC": 87,
      "]([": 88,
      "Si": 89,
      "CN": 90,
      "-]": 91,
      "CCCCCCCCCCC": 92,
      "CCCCCCCCCCCCC": 93,
      ")/": 94,
      "+]": 95,
      "CCCCCCCCCCCCCCCCC": 96,
      "CCCCCCCCCCCC": 97,
      "CCCCCCCCCC": 98,
      "CCCCCCCCCCCCCCCCCCCCC": 99
    },
    "merges": [
      "C C",
      "CC CC",
      "( =",
      "CCCC CCCC",
      "O C",
      "] (",
      "CC C",
      ") (",
      "C OC",
      "@ @",
      "CCCCCCCC CCCCCCCC",
      "C O",
      "N C",
      "CCCC C",
      "CO P",
      "C l",
      "CCCC CCC",
      "CCCC CC",
      ") [",
      "CCCCCCCC C",
      "O CC",
      "]( [",
      "S i",
      "C N",
      "- ]",
      "CCCCCCCC CCC",
      "CCCCCCCC CCCCC",
      ") /",
      "+ ]",
      "CCCCCCCCCCCCCCCC C",
      "CCCCCCCC CCCC",
      "CCCCCCCC CC",
      "CCCCCCCCCCCCCCCC CCCCC"
    ]
  }
}